/*
 * =====================================================================================
 * 
 * 5.27.2016
 *
 * 어떤 고속도로가 청소가 돼야 한다고 하자
 *
 * 그 길이가 10000 미터이다
 *
 * 어떤 청소 도구를 최대 1000 개 놓는게 필요하다
 *
 * 어디 점에 놓아야 하는지는 주어진다. 그 주어진 점만
 *
 * 커버 될 수 있으면 어떻게 놓던지 상관 없다.
 *
 *         여기
 * ㅁ ㅁ ㅁ ㅁ 
 *   
 *    ㅁ ㅁ ㅁ ㅁ 
 *      
 *       ㅁ ㅁ ㅁ ㅁ
 *          
 *          ㅁ ㅁ ㅁ ㅁ
 *
 * 한 청소도구의 길이는 1부터 10000 개 가능하다
 *
 * 어떻게 놓아야 가장 길이를 차지 하게 놓을 수 있겠는가?
 *
 * =====================================================================================
 */


